load-testing/commonwealth-api.yml
config:
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
      metricsNamespace: "latency_metrics"
    publish-metrics:
      - type: statsd
        prefix: "artillery.publish_metrics_plugin."
  environments:
    us:
      target: "https://us.unique.rocks"
    eu:
      target: "https://eu.unique.rocks"
    local:
      target: "http://localhost:8080"
    beta:
      target: "https://commonwealth-beta.herokuapp.com"
    frick:
      target: "https://commonwealth-frick.herokuapp.com"
  http:
    extendedMetrics: true
  phases:
    - name: "Warm up"
      duration: 10
      arrivalRate: 5
  processor: "functions.js" # Specify the path to the JavaScript file containing custom functions
scenarios:
  - name: "Read Endpoints"
    flow:
      - get:
          url: "/"
      - get:
          url: "/api/domain"
      - get:
          url: "/api/status"
      - post:
          url: "/api/viewDiscussionNotifications"
          form:
            jwt: "{{$processEnvironment.JWT}}"
      - post:
          url: "/api/viewChainEventNotifications"
          form:
            jwt: "{{$processEnvironment.JWT}}"
      - post:
          url: "/api/getSubscribedChains"
          form:
            jwt: "{{$processEnvironment.JWT}}"
      - get:
          url: "/api/viewSubscriptions"
          qs:
            jwt: "{{$processEnvironment.JWT}}"
      - get:
          url: "/cmn-protocol"
      - get:
          url: "/api/bulkOffchain"
          qs:
            chain: "cmn-protocol"
            community:
            jwt: "{{$processEnvironment.JWT}}"
      - get:
          url: "/api/threads"
          qs:
            chain: "cmn-protocol"
            active: true
            threads_per_topic: 3
      - get:
          url: "/api/bulkTopics"
          qs:
            chain: "cmn-protocol"
      - post:
          url: "/api/threadsUsersCountAndAvatars"
          json:
            chain: "cmn-protocol"
            threads: []
      - get:
          url: "/api/threads"
          qs:
            chain: "cmn-protocol"
            bulk: true
            limit: 20
            page: 0
            includePinnedThreads: true
            to_date: "2023-07-05T06:39:12.543Z"
            orderBy: "createdAt:desc"
          capture:
            json: "$.result.threads[*].id"
            as: "threadIds"
      - post:
          url: "/api/reactionsCounts"
          json:
            thread_ids: "{{$threadIds}}"
      - post:
          url: "/api/selectChain"
          form:
            chain: "cmn-protocol"
            auth: true
            jwt: "{{$processEnvironment.JWT}}"
      - post:
          url: "/api/viewUserActivity"
          form:
            jwt: "{{$processEnvironment.JWT}}"